package org.example._2024_05_15;
//Создать класс Test.
//Создать метод main.
//Создать все переменные примитивных и не примитивных типов.
//Присвоить значения переменным.
//Распечатать результат в консоль
public class Test {
    public static void main(String[] args) {
        byte c = 1;
        short d = 300;
        long e = 1000_000_000L;
        float g = 123.123f;
        char s = 's';
        int a = 33;
        double b = 441.321;

        System.out.println(a+b+d+e+g+s);
    }
}
